---
kind: other
id: Methods.T:Autodesk.Revit.UI.SplitButton
source: html/33e9aca1-21f9-b21b-b87f-09498d1e59e5.htm
---
# SplitButton Methods

Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.